<a href="https://colab.research.google.com/github/CatMolnia/BOOKS_study/blob/main/Pandas_%D0%B2_%D0%B4%D0%B5%D0%B9%D1%81%D1%82%D0%B2%D0%B8%D0%B8.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

"""---ЗНАКОМСТВО С БИБЛИОТЕКОЙ PANDAS---"""

"""---1.3 ОБЗОР БИБЛИОТЕКИ PANDAS---"""

"""---1.3.2. Операции над объектами DataFrame---"""

In [13]:
import pandas as pd

In [16]:
movies = pd.read_csv('movies.csv', index_col='Title') # импорт данных

In [17]:
movies.iloc[499] # извлекаем строку по индексу (числовой позиции)

Rank           500
Studio         Fox
Gross     $288.30
Year          2018
Name: Maze Runner: The Death Cure, dtype: object

In [18]:
movies.loc['Forrest Gump'] # извлекаем строку по индексу (по метке индекса)

Rank            119
Studio    Paramount
Gross      $677.90
Year           1994
Name: Forrest Gump, dtype: object